Tekla.Structures.Model.ModelObject.ModelObjectEnum.REBAR_SET
The rebar set (PROTOTYPE FUNCTIONALITY).

Tekla.Structures.Model.ModelObject.ModelObjectEnum.REBAR_SET_ADDITION
The rebar set addition (PROTOTYPE FUNCTIONALITY).

Tekla.Structures.Model.ModelObject.ModelObjectEnum.REBAR_PROPERTY_STRIP
The rebar property strip (PROTOTYPE FUNCTIONALITY).

Tekla.Structures.Model.ModelObject.ModelObjectEnum.REBAR_END_DETAIL_STRIP
The rebar end-detail strip (PROTOTYPE FUNCTIONALITY).

Tekla.Structures.Model.ModelObject.ModelObjectEnum.REBAR_SPLITTER
The rebar splitter (PROTOTYPE FUNCTIONALITY).